export interface Offer {
    id: number;
    text: string;
    link?: string;
}

export const offers: Offer[] = [
    {
        id: 1,
        text: "✨ عروض حصرية: خصم 10% على وحدات مشروع الأندلس لفترة محدودة! ✨",
        link: "/projects/42"
    },
    {
        id: 2,
        text: "🚀 انطلاق المرحلة الثانية من بيع مشروع 'قمم المجد' - احجز وحدتك الآن",
    },
    {
        id: 3,
        text: "💎 استثمارك يبدأ من هنا: خطط سداد ميسرة تصل إلى 5 سنوات بدون فوائد",
        link: "/#contact"
    }
];
